/***************************************************************************
                          ai.h  -  description
                             -------------------
    begin                : Thu Apr 11 2002
    copyright            : (C) 2001 by Michael Speck
    email                : kulkanie@gmx.net
 ***************************************************************************/

/***************************************************************************
 *                                                                         *
 *   This program is free software; you can redistribute it and/or modify  *
 *   it under the terms of the GNU General Public License as published by  *
 *   the Free Software Foundation; either version 2 of the License, or     *
 *   (at your option) any later version.                                   *
 *                                                                         *
 ***************************************************************************/

#ifndef __AI_H
#define __AI_H

/*
====================================================================
Начать ход
====================================================================
*/
void ai_init( void );

/*
====================================================================
Поставить в очередь следующие действия (если эти действия были обработаны движком
эта функция вызывается снова и снова до end_turn
действие получено).
====================================================================
*/
void ai_run( void );

/*
====================================================================
Отменить шаги (например, выделение памяти), сделанные в ai_init ()
====================================================================
*/
void ai_finalize( void );

#endif
