/***************************************************************************
                          engine.h  -  description
                             -------------------
    begin                : Sat Feb 3 2001
    copyright            : (C) 2001 by Michael Speck
    email                : kulkanie@gmx.net
 ***************************************************************************/
/***************************************************************************
                     Modifications by LGD team 2012+.
 ***************************************************************************/
/***************************************************************************
 *                                                                         *
 *   This program is free software; you can redistribute it and/or modify  *
 *   it under the terms of the GNU General Public License as published by  *
 *   the Free Software Foundation; either version 2 of the License, or     *
 *   (at your option) any later version.                                   *
 *                                                                         *
 ***************************************************************************/

#ifndef __ENGINE_H
#define __ENGINE_H

/*
====================================================================
Выберите это устройство и при необходимости отмените выбор старого.
Снимите выделение, если в качестве единицы измерения передается NULL.
====================================================================
*/
void engine_select_unit( Unit *unit );

/*
====================================================================
Если x, y отсутствуют на экране, отцентрируйте этот фрагмент карты и проверьте, не
копирование экрана возможно (но только если use_sc имеет значение True)
====================================================================
*/
int engine_focus( int x, int y, int use_sc );

/*
====================================================================
Создать движок (загрузить ресурсы, не измененные сценарием)
====================================================================
*/
int engine_create();
void engine_delete();

/*
====================================================================
Запустите движок, загрузив сценарий либо как сохраненную игру, либо
новый сценарий мировой 'setup'.
====================================================================
*/
int engine_init();
void engine_shutdown();

/*
====================================================================
Запустите двигатель (запускается с титульного экрана)
====================================================================
*/
void engine_run();

#endif
