/***************************************************************************
                          event.h  -  description
                             -------------------
    begin                : Wed Mar 20 2002
    copyright            : (C) 2001 by Michael Speck
    email                : kulkanie@gmx.net
 ***************************************************************************/

/***************************************************************************
 *                                                                         *
 *   This program is free software; you can redistribute it and/or modify  *
 *   it under the terms of the GNU General Public License as published by  *
 *   the Free Software Foundation; either version 2 of the License, or     *
 *   (at your option) any later version.                                   *
 *                                                                         *
 ***************************************************************************/

#ifndef __EVENT_H
#define __EVENT_H

/*
====================================================================
Фильтр событий. Пока он активен, события KEY или MOUSE отсутствуют.
будет доступен SDL_PollEvent ().
====================================================================
*/
int event_filter( const SDL_Event *event );

/*
====================================================================
Включение / отключение фильтрации событий мыши и клавиатуры.
====================================================================
*/
void event_enable_filter( void );
void event_disable_filter( void );
void event_clear( void );

/*
====================================================================
Проверьте, произошло ли событие перемещения с момента последнего вызова.
====================================================================
*/
int event_get_motion( int *x, int *y );
/*
====================================================================
Проверьте, была ли нажата кнопка, и верните ее значение и текущий
положение мыши.
====================================================================
*/
int event_get_buttondown( int *button, int *x, int *y );
int event_get_buttonup( int *button, int *x, int *y );

/*
====================================================================
Получить текущую позицию курсора.
====================================================================
*/
void event_get_cursor_pos( int *x, int *y );

/*
====================================================================
Проверьте, установлена ли в данный момент кнопка "кнопка".
====================================================================
*/
enum {
    BUTTON_NONE = 0,
    BUTTON_LEFT,
    BUTTON_MIDDLE,
    BUTTON_RIGHT,
    WHEEL_UP,
    WHEEL_DOWN
};
int event_check_button( int button );

/*
====================================================================
Проверьте, установлен ли в данный момент «ключ».
====================================================================
*/
int event_check_key( int key );

/*
====================================================================
Проверьте, был ли получен SDL_QUIT.
====================================================================
*/
int event_check_quit();

/*
====================================================================
Очистить ключ события SDL (события нажатия клавиши)
====================================================================
*/
void event_clear_sdl_queue();

/*
====================================================================
Подождите, пока не будет нажата ни клавиша, ни кнопка.
====================================================================
*/
void event_wait_until_no_input();

#endif
