/***************************************************************************
                          file.h  -  description
                             -------------------
    begin                : Thu Jan 18 2001
    copyright            : (C) 2001 by Michael Speck
    email                : kulkanie@gmx.net
 ***************************************************************************/
/***************************************************************************
                     Modifications by LGD team 2012+.
 ***************************************************************************/
/***************************************************************************
 *                                                                         *
 *   This program is free software; you can redistribute it and/or modify  *
 *   it under the terms of the GNU General Public License as published by  *
 *   the Free Software Foundation; either version 2 of the License, or     *
 *   (at your option) any later version.                                   *
 *                                                                         *
 ***************************************************************************/


#ifndef __FILE_H
#define __FILE_H

#include <stdio.h>

enum {
    LIST_ALL = 0,
    LIST_SCENARIOS,
    LIST_CAMPAIGNS
};

/*
====================================================================
Имя файла и тип имени папки.
====================================================================
*/
typedef struct {
    char *file_name;
    char *internal_name;
} Name_Entry_Type;

/*
====================================================================
Прочитать все строки из файла.
====================================================================
*/
List* file_read_lines( FILE *file );

/*
====================================================================
Вернуть список (автоматически удаленные строки)
со всеми доступными файлами и каталогами в пути
с расширением ext (если! = 0). Не показывать скрытые файлы или
Makefile вещи.
Директории отмечены звездочкой.
====================================================================
*/
List* dir_get_entries( const char *path, const char *root, int file_type, int emptyFile, int dir_only );

/*
====================================================================
Проверьте, есть ли имя файла в списке.
Возвращаемое значение: позиция имени файла иначе -1.
====================================================================
*/
int dir_check( List *list, char *item );

/*
====================================================================
Создайте каталог, если имя папки не существует.
====================================================================
*/
int dir_create( const char *folderName, const char *subdir );

/*
====================================================================
Найдите полное имя файла.
Расширения добавляются в соответствии с заданным типом.
'i' - изображения (bmp, png, jpg)
's' - звуки (wav, ogg, mp3)
'o' - сценарии (lgscn, pgscn)
'c' - кампании (lgcam, pgcam)
'n' - нации (ndb, lgdndb)
====================================================================
*/
int search_file_name( char *pathFinal, char *extension, const char *name, const char *modFolder, char *subFolder, const char type );

/*
====================================================================
Найдите имя файла в каталогах. Продление уже дано.
====================================================================
*/
int search_file_name_exact( char *pathFinal, char *path, char *modFolder, char *subFolder );

#endif
