/***************************************************************************
                          nation.h  -  description
                             -------------------
    begin                : Wed Jan 24 2001
    copyright            : (C) 2001 by Michael Speck
    email                : kulkanie@gmx.net
 ***************************************************************************/
/***************************************************************************
                     Modifications by LGD team 2012+.
 ***************************************************************************/
/***************************************************************************
 *                                                                         *
 *   This program is free software; you can redistribute it and/or modify  *
 *   it under the terms of the GNU General Public License as published by  *
 *   the Free Software Foundation; either version 2 of the License, or     *
 *   (at your option) any later version.                                   *
 *                                                                         *
 ***************************************************************************/

#ifndef __NATION_H
#define __NATION_H

/*
====================================================================
Нация предоставляет полное имя и значок флага для юнитов.
(которые принадлежат определенной нации).
====================================================================
*/
typedef struct {
    char *id;
    char *name;
    int  flag_offset;
    int  no_purchase; /* есть ли у страны юниты для покупки;
                         обновляется при загрузке сценария */
} Nation;

/*
====================================================================
Загрузить базу данных наций.
====================================================================
*/
int nations_load( char *fname );
/*
====================================================================
Прочтите нации из path / fname.
====================================================================
*/
int nations_load_ndb( char *fname, char *path );
/*
====================================================================
Прочтите нации из пути / имени в формате CSV.
====================================================================
*/
int nations_load_lgdndb( char *fname, char *path );
/*
====================================================================
Удалите нации.
====================================================================
*/
void nations_delete( void );

/*
====================================================================
Искать нацию по строке id. Если это не удается, возвращается 0.
====================================================================
*/
Nation* nation_find( char *id );

/*
====================================================================
Поиск нации по позиции в списке. Если это не удается, возвращается 0.
====================================================================
*/
Nation* nation_find_by_id( int id );

/*
====================================================================
Получить индекс нации (позиция в списке)
====================================================================
*/
int nation_get_index( Nation *nation );

/*
====================================================================
Нарисуйте значок флага на поверхности.
  NATION_DRAW_FLAG_NORMAL: просто нарисуйте значок.
  NATION_DRAW_FLAG_OBJ: добавьте золотую рамку, чтобы пометить как военную
                           задача
====================================================================
*/
enum { NATION_DRAW_FLAG_NORMAL = 0, NATION_DRAW_FLAG_OBJ };
void nation_draw_flag( Nation *nation, SDL_Surface *surf, int x, int y, int obj );

/*
====================================================================
Получите определенное значение пикселя в флаге страны.
====================================================================
*/
Uint32 nation_get_flag_pixel( Nation *nation, int x, int y );

#endif
