/***************************************************************************
                          strat_map.h  -  description
                             -------------------
    begin                : Fri Apr 5 2002
    copyright            : (C) 2001 by Michael Speck
    email                : kulkanie@gmx.net
 ***************************************************************************/

/***************************************************************************
 *                                                                         *
 *   This program is free software; you can redistribute it and/or modify  *
 *   it under the terms of the GNU General Public License as published by  *
 *   the Free Software Foundation; either version 2 of the License, or     *
 *   (at your option) any later version.                                   *
 *                                                                         *
 ***************************************************************************/

#ifndef __STRATMAP_H
#define __STRATMAP_H

/*
====================================================================
Вызывается после загрузки сценария в init_engine () и создает
изображения тайлов стратегической карты, флаги и сама strat_map +
unit_layer
====================================================================
*/
void strat_map_create();

/*
====================================================================
Очистить материал, выделенный strat_map_create ()
====================================================================
*/
void strat_map_delete();

/*
====================================================================
Обновите / нарисуйте растровое изображение, содержащее стратегическую карту.
====================================================================
*/
void strat_map_update_terrain_layer();
void strat_map_update_unit_layer();
void strat_map_draw();

/*
====================================================================
Обработка ввода движения. Если указатель мыши находится на тайле карты x, y и true
возвращается.
====================================================================
*/
int strat_map_get_pos( int cx, int cy, int *x, int *y );

/*
====================================================================
Мигайте точками, которые показывают неподвижные юниты.
====================================================================
*/
void strat_map_blink();

#endif
